// Напишите программу которая принимает на вход число и выдает количество цифр в числе

Console.Write("Input number: ");
int number = Convert.ToInt32(Console.ReadLine());
